tap "bufbuild/buf"
tap "caarlos0/tap"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "sst/tap"
tap "withgraphite/tap"
# Statistics utility to count lines of code
brew "cloc"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Load/unload environment variables based on $PWD
brew "direnv"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Database migrations CLI tool
brew "golang-migrate"
# Fast linters runner for Go
brew "golangci-lint"
# Interactive web UI for gRPC, along the lines of postman
brew "grpcui"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Simple terminal UI for git commands
brew "lazygit"
# Run a Kubernetes cluster locally
brew "minikube", link: false
# Mock code autogenerator for Golang
brew "mockery"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node@16"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Protoc plugin that generates code for gRPC-Go clients
brew "protoc-gen-go-grpc"
# Generic machine emulator and virtualizer
brew "qemu"
# Persistent key-value database, with built-in net interface
brew "redis"
# Daemon to provide vmnet.framework support for rootless QEMU
brew "socket_vmnet"
# Generate type safe Go from SQL
brew "sqlc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# Task Timer (tt) is a dead simple TUI task timer
brew "caarlos0/tap/tt"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Allows you to manage your stacked changes and submit them for review on GitHub
brew "withgraphite/tap/graphite"
vscode "anthropic.claude-code"
vscode "archety.material-icons"
vscode "aykutsarac.jsoncrack-vscode"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "coderabbit.coderabbit-vscode"
vscode "cweijan.vscode-database-client2"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "helgardrichard.helium-icon-theme"
vscode "humao.rest-client"
vscode "jamesmaj.easy-icons"
vscode "leizongmin.node-module-intellisense"
vscode "liamhammett.inline-parameters"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "pkief.material-icon-theme"
vscode "premparihar.gotestexplorer"
vscode "redhat.vscode-yaml"
vscode "redis.redis-for-vscode"
vscode "ritwickdey.liveserver"
vscode "rooveterinaryinc.roo-cline"
vscode "saoudrizwan.claude-dev"
vscode "teabyii.ayu"
vscode "tooltitudeteam.tooltitude"
vscode "tooltitudeteam.tooltitude-pb"
vscode "tooltitudeteam.tooltitude-ym"
vscode "tsandall.opa"
vscode "upstash.context7-mcp"
vscode "usernamehw.errorlens"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
go "github.com/bufbuild/buf/cmd/buf"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "gotest.tools/gotestsum"
go "grabber"
go "github.com/jorgerojas26/lazysql"
go "github.com/vektra/mockery/v2"
go "github.com/oapi-codegen/oapi-codegen/v2/cmd/oapi-codegen"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-grpc-gateway"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-openapiv2"
go "github.com/yoheimuta/protolint/cmd/protolint"
go "github.com/xvzc/SpoofDPI/cmd/spoof-dpi"
go "honnef.co/go/tools/cmd/staticcheck"
